---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.GenericZoneName
source: html/d52a6291-378e-03af-2d82-839df8196eef.htm
---
# Autodesk.Revit.DB.ParameterTypeId.GenericZoneName Property

"Name"

## Syntax (C#)
```csharp
public static ForgeTypeId GenericZoneName { get; }
```